labved/NODEBOX-RF868_STM32LDISCO/USER/LIB/LIB_HC05/LIB_HC05.cpp
#include "stm32l1xx.h" 
#include "Settings.h" 
#include "Pinouts.h"
#include "Shortcodes.h"
#include "Variables.h"

#include "Functions.h"
#include "Conversions.h"

#include "HAL_HC05.h"
#include "LIB_HC05.h"

#include "HC05_SHORTCODES.h"
#include "HC05_TYPEDEF.h"

#ifdef LIB_HC05_H

#if (_USE_BT == 1)

HAL_HC05 hc05;

/****************************************************************
*FUNCTION NAME:test
*FUNCTION     :test codes
*INPUT        :void
*OUTPUT       :void
****************************************************************/
void LIB_HC05::test(void)
{
  char      *strStart, *str1;
  setAtMode();
  
  USART_ITConfig(HC05_USART_CH, USART_IT_RXNE, ENABLE);
  hc05.sendAtCommand("AT+VERSION?\r\n", 200, 0);

  
  
  // Read & Update Operation
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  

  str1 = strstr(strStart,"+VERSION:");
  
  if(str1!=NULL)
    sscanf(str1,"+VERSION:%s",Sim80x.IMEI);    

  debugTerminal("HC05_HC05_getVersion");

  memset(Sim80x.UsartRxBuffer,0,sizeof(Sim80x.UsartRxBuffer));
                     
}

/****************************************************************
*FUNCTION NAME:powerOnReset
*FUNCTION     :Switch reset 
*INPUT        :void
*OUTPUT       :void
****************************************************************/
void LIB_HC05::powerOnReset(void)
{
    hc05.hardReset(); 
}

/****************************************************************
*FUNCTION NAME:RegConfigSettings
*FUNCTION     :HC05 register config 
*INPUT        :void
*OUTPUT       :void
****************************************************************/
void LIB_HC05::regConfigSettings(void)
{
  setAtMode();
  setFactoryDefault(200);
}

/****************************************************************
*FUNCTION NAME:setATMode
*FUNCTION     :set device to respond to AT Command Mode
*INPUT        :void
*OUTPUT       :void
****************************************************************/
 void LIB_HC05::setAtMode(void)
 { 
   GPIO_ResetBits(HC05_GPIO_EN, HC05_PIN_EN);      //  EN pulled to LOW
   delay_ms(100);
   GPIO_SetBits(HC05_GPIO_KEY, HC05_PIN_KEY);      //  KEY PIN HIGH TO ON COMMAND AT MODE
    
   delay_ms(300);
    
   GPIO_SetBits(HC05_GPIO_EN, HC05_PIN_EN);       // EN floating to HIGH
   delay_ms(1000);   
 }

 /****************************************************************
*FUNCTION NAME:setDataMode
*FUNCTION     :set device to respond to Data Mode
*INPUT        :void
*OUTPUT       :void
****************************************************************/
void LIB_HC05::setDataMode(void)
{
  GPIO_ResetBits(HC05_GPIO_EN, HC05_PIN_EN);      //  POWER OFF
  delay_ms(100);
  GPIO_ResetBits(HC05_GPIO_KEY, HC05_PIN_KEY);    //  KEY PIN LOW TO ON DATA MODE

  delay_ms(300);

  GPIO_SetBits(HC05_GPIO_EN, HC05_PIN_EN);         //POWER ON
  delay_ms(1000);   

}

/****************************************************************
*FUNCTION NAME:return debugTerminal
*FUNCTION     :Prints response to terminal IO
*INPUT        :message
*OUTPUT       :void
****************************************************************/
bool LIB_HC05::debugTerminal(char *msg)
{
  char      *strStart, *str1;

  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
  str1 = strstr(strStart,"OK\r\n");
  //#if (_SIM80X_DEBUG== 1 || _SIM80X_DEBUG==2)
   

     strStart = (char*)&Sim80x.UsartRxBuffer[0];  
    str1 = strstr(strStart,"OK\r\n");

      if(sizeof(str1)!=0)
      { 
        #if (_SIM80X_DEBUG== 1 || _SIM80X_DEBUG==2)
          #if (_SIM80X_DEBUG==2)
            printf("\r\nAT Respone : %s",Sim80x.UsartRxBuffer);
          #endif
          printf("\r\n%s ---> OK\r\n", msg);
        #endif
        return sizeof(str1);
      }
      else
      {
          
        #if (_SIM80X_DEBUG== 1 || _SIM80X_DEBUG==2)
          printf("\r\n% ---> FAILED\r\n", msg);
        #endif
        return 0;
      }
    
  //#endif
}

/****************************************************************
*FUNCTION NAME:Init
*FUNCTION     :initialization
*INPUT        :void
*OUTPUT       :void
****************************************************************/
void LIB_HC05::Init(void)
{
  hc05.gpioInit();
  hc05.uartInit(HC05_BAUDRATE_AT);
  powerOnReset();

  regConfigSettings();
}

/****************************************************************
*FUNCTION NAME:softReset
*FUNCTION     :soft Reset
*INPUT        :timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::softReset(unsigned long timeout)
{
  //PGM_STRING_MAPPED_TO_RAM(reset_cmd, "RESET");
  return (hc05.sendAtCommand("AT+RESET", timeout, 0)); // CHECK
}

/****************************************************************
*FUNCTION NAME:probe
*FUNCTION     :probe
*INPUT        :timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::probe(unsigned long timeout)
{
  startOperation(timeout);
  hc05.sendAtCommand("AT\r\n",200,0);
  
  return hc05.readOperationResult();
}

/****************************************************************
*FUNCTION NAME:setFactoryDefault
*FUNCTION     :set to factory settings
*INPUT        :timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::setFactoryDefault(unsigned long timeout)
{
  hc05.sendAtCommand("AT+ORGL\r\n", 200, 0);
  return debugTerminal("HC05_setFactoryDefault");
  
}

/****************************************************************
*FUNCTION NAME:getVersion
*FUNCTION     :get version number 
*INPUT        :buffer , buffer_size , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::getVersion(char *buffer, size_t buffer_size, unsigned long timeout)
{
  uint8_t answer ;
  startOperation(timeout);

  if (!buffer || buffer_size <= 1)
    return false;

