labved/NODEBOX-RF868_STM32LDISCO/USER/LIB/LIB_HC05/LIB_HC05.cpp
  //PGM_STRING_MAPPED_TO_RAM(command, "VERSION?");
  answer = hc05.sendAtCommand("AT+VERSION?\r\n", 200, 0);
   processVersion(buffer , buffer_size, 1);
  /* Response should look like "+VERSION:2.0-20100601" */
  char response[30];

  //PGM_STRING_MAPPED_TO_RAM(response_pattern, "+VERSION:");
  
 /*  const char *version = hc05.readResponseWithPrefix(
     response, sizeof(response), AT_RESP_VERSION);
  */
 /*   if (m_errCode != HC05_OK)
    return false;

  if (!version)
  {
    *buffer = 0;
    return hc05.readOperationResult() && false;
  }
 
  snprintf(buffer, buffer_size, "%s", version);
  return answer ;*/
} 

/****************************************************************
*FUNCTION NAME:getAddress
*FUNCTION     :getAddress
*INPUT        :address : BluetoothAddress , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::getAddress(BluetoothAddress &address, unsigned long timeout)
{
  //PGM_STRING_MAPPED_TO_RAM(command_name, "ADDR");
  return hc05.readAddressWithCommand(address, AT_ADDR, timeout);

}

/****************************************************************
*FUNCTION NAME:getName
*FUNCTION     :get Name from external device
*INPUT        :buffer , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::getName(char *buffer, unsigned long timeout)
{
  startOperation(timeout);

  if (!buffer)
  {
    m_errCode = HC05_FAIL;
    return false;
  }

  //PGM_STRING_MAPPED_TO_RAM(command, "NAME?");
  hc05.sendAtCommand("AT+NAME?\r\n",200,0);
  return debugTerminal("HC05_getName");
  

  char response[40];
  
  //PGM_STRING_MAPPED_TO_RAM(response_pattern, "+NAME:");
  
  char *name_part = hc05.readResponseWithPrefix(response, sizeof(response), AT_RESP_NAME);

  if (m_errCode != HC05_OK)
    return false;

  if (!name_part)
  {
    *buffer = 0;
    return hc05.readOperationResult() && false;
  }

  //PGM_STRING_MAPPED_TO_RAM(format, "%s");
  
  snprintf(buffer, HC05_NAME_BUFSIZE, "%s", name_part);

  return hc05.readOperationResult();
}

/****************************************************************
*FUNCTION NAME:setName
*FUNCTION     :set Name to extenal device
*INPUT        :name, timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::setName(const char *name, unsigned long timeout)
{
 
  char temp[20];
  snprintf(temp, sizeof(temp), "AT+NAME=%s\r\n", name); 
  hc05.sendAtCommand(temp,200, 0);
  return debugTerminal("HC05_setSimAccess");
  //PGM_STRING_MAPPED_TO_RAM(command, "NAME=");
 
  
}

/****************************************************************
*FUNCTION NAME:getRemoteDeviceName
*FUNCTION     :get Remote Device Name 
*INPUT        :address, buffer, buffer_size, timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::getRemoteDeviceName(const BluetoothAddress &address,
  char *buffer, size_t buffer_size, unsigned long timeout)
{
  startOperation(timeout);

  if (!buffer || !buffer_size)
  {
    m_errCode = HC05_FAIL;
    return false;
  }

  char address_str[HC05_ADDRESS_BUFSIZE];
  hc05.printBluetoothAddress(address_str, address, ',');
  
  //PGM_STRING_MAPPED_TO_RAM(command, "RNAME?");
  
  hc05.sendAtCommand("AT+RNAME?\r\n", timeout, 0); //check
  debugTerminal("HC05_getRemoteDeviceName");
  processRemoteDeviceName(address, buffer, buffer_size, 1);
  char response[40];
  
  //PGM_STRING_MAPPED_TO_RAM(response_pattern, "+RNAME:");
  char *name_part = hc05.readResponseWithPrefix(response, sizeof(response), "+RNAME:");

  if (m_errCode != HC05_OK)
    return false;

  if (!name_part)
  {
    *buffer = 0;
    return hc05.readOperationResult() && false;
  }

  //PGM_STRING_MAPPED_TO_RAM(format, "%s");
  snprintf(buffer, buffer_size, "%s", name_part);

  return hc05.readOperationResult();
}

/****************************************************************
*FUNCTION NAME:getRole
*FUNCTION     :getRole
*INPUT        :HC05 role , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::getRole(HC05_Role &role, unsigned long timeout)
{
  startOperation(timeout);

  //PGM_STRING_MAPPED_TO_RAM(command, "ROLE?");
  hc05.sendAtCommand("AT+ROLE?\r\n", timeout, 0 );
  return debugTerminal("HC05_setSimAccess");
/* 
  char response[20];
 // PGM_STRING_MAPPED_TO_RAM(response_pattern, "+ROLE:");
  const char *role_str = hc05.readResponseWithPrefix(
    response, sizeof(response), AT_RESP_ROLE);

  if (m_errCode != HC05_OK)
    return false;

  if (!role_str)
    return hc05.readOperationResult() && false;

  role = static_cast<HC05_Role>(atol(role_str));

  return hc05.readOperationResult();
 */}

/****************************************************************
*FUNCTION NAME:setRole
*FUNCTION     :setRole
*INPUT        :role , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::setRole(HC05_Role role, unsigned long timeout)
{
  char temp[20];
  snprintf(temp, sizeof(temp), "AT+ROLE=%d", role);

  //PGM_STRING_MAPPED_TO_RAM(command, "ROLE=");
  return hc05.sendAtCommand(temp, timeout, 0);
  return debugTerminal("HC05_setRole");

}

/****************************************************************
*FUNCTION NAME:getDeviceClass
*FUNCTION     :get Device Class 
*INPUT        :device_class , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::getDeviceClass(uint32_t &device_class, unsigned long timeout)
{
  startOperation(timeout);

  //PGM_STRING_MAPPED_TO_RAM(command, "CLASS?");
  hc05.sendAtCommand("AT+CLASS?\r\n", timeout, 0 );
  return debugTerminal("HC05_getDeviceClass");
   processDeviceClass(device_class, 1);

