labved/NODEBOX-RF868_STM32LDISCO/USER/LIB/LIB_HC05/LIB_HC05.cpp
  speed = atol(mode_str);
  mode_str = strchrnul(mode_str, ',');

  if (*mode_str != ',')
  {
    m_errCode = HC05_FAIL;
    return hc05.readOperationResult() && false;
  }

  stop_bits = atol(++mode_str) + 1;
  mode_str = strchrnul(mode_str, ',');

  if (*mode_str != ',')
  {
    m_errCode = HC05_FAIL;
    return hc05.readOperationResult() && false;
  }

  parity = static_cast<HC05_Parity>(atol(++mode_str));

  return hc05.readOperationResult();
}

/****************************************************************
*FUNCTION NAME:setSerialMode
*FUNCTION     :setSerialMode
*INPUT        :speed , stop_bits ,  parity , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::setSerialMode(uint32_t speed,
  uint8_t stop_bits, HC05_Parity parity, unsigned long timeout)
{
  stop_bits -= 1; // 0: 1 stop bit, 1: 2 stop bits, any other are not allowed

  char temp[20];
  snprintf(temp, sizeof(temp), "AT+UART=%lu,%u,%u", speed, stop_bits, parity);

  //PGM_STRING_MAPPED_TO_RAM(command, "UART=");
  hc05.sendAtCommand(temp, timeout, 0);
  return debugTerminal("HC05_setSerialMode");
}

/****************************************************************
*FUNCTION NAME:getConnectionMode
*FUNCTION     :getConnectionMode  
*INPUT        :connection_mode , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::getConnectionMode(
  HC05_Connection &connection_mode, unsigned long timeout)
{
  startOperation(timeout);

  //PGM_STRING_MAPPED_TO_RAM(command, "CMODE?");
  hc05.sendAtCommand("AT+CMODE?\r\n", timeout, 0);
  return debugTerminal("HC05_getConnectionMode");
  processConnectionMode(connection_mode, 1);

  char response[20];
  //PGM_STRING_MAPPED_TO_RAM(response_pattern, "+CMOD:");
  const char *mode_part = hc05.readResponseWithPrefix(
    response, sizeof(response), AT_RESP_CMODE);

  if (m_errCode != HC05_OK)
    return false;

  if (!mode_part)
    return hc05.readOperationResult() && false;

  connection_mode = static_cast<HC05_Connection>(atol(mode_part));

  return hc05.readOperationResult();
}

/****************************************************************
*FUNCTION NAME:setConnectionMode
*FUNCTION     :setConnectionMode
*INPUT        :connection_mode , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::setConnectionMode(
  HC05_Connection connection_mode, unsigned long timeout)
{
  char temp[20];
  snprintf(temp, sizeof(temp), "AT+CMODE=%u", connection_mode);

  //PGM_STRING_MAPPED_TO_RAM(command, "CMODE=");
  hc05.sendAtCommand(temp, timeout, 0);
  return debugTerminal("HC05_setConnectionMode");
}

/****************************************************************
*FUNCTION NAME:bind
*FUNCTION     :bind
*INPUT        :address : BluetoothAddress , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::bind(const BluetoothAddress &address, unsigned long timeout)
{
  //PGM_STRING_MAPPED_TO_RAM(command_name, "BIND");
  return hc05.writeAddressWithCommand(address, AT_BIND, timeout);
}

/****************************************************************
*FUNCTION NAME:getAddressBound
*FUNCTION     :getAddressBound
*INPUT        :address : BluetoothAddress , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::getAddressBound(BluetoothAddress &address, unsigned long timeout)
{
  //PGM_STRING_MAPPED_TO_RAM(command_name, "BIND");
  return hc05.readAddressWithCommand(address, AT_BIND, timeout);
}

/****************************************************************
*FUNCTION NAME:getLeds
*FUNCTION     :get Leds status
*INPUT        :led_status , led_connection , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::getLeds(bool &led_status,
  bool &led_connection, unsigned long timeout)
{
  startOperation(timeout);

  //PGM_STRING_MAPPED_TO_RAM(command, "POLAR?");
  hc05.sendAtCommand("AT+POLAR?\r\n" ,timeout ,0 );
  return debugTerminal("HC05_getLeds");
  processLed(led_status, led_connection, 1);
/* 
  led_status = 0;
  led_connection = 0;

  char response[30];
  
  //PGM_STRING_MAPPED_TO_RAM(response_pattern, "+POLAR:");
  
  char *status_part = hc05.readResponseWithPrefix(
    response, sizeof(response), AT_RESP_POLAR);

  if (m_errCode != HC05_OK)
    return false;

  if (!status_part)
    return hc05.readOperationResult() && false;

  led_status = atol(status_part);
  status_part = strchrnul(status_part, ',');

  if (*status_part != ',')
    return hc05.readOperationResult() && false;

  led_connection = atol(++status_part);

  return hc05.readOperationResult();
 */}

/****************************************************************
*FUNCTION NAME:setLeds
*FUNCTION     :set Leds status
*INPUT        :led_status , led_connection , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::setLeds(bool led_status,
  bool led_connection, unsigned long timeout)
{
  char temp[20];
  snprintf(temp, sizeof(temp), "AT+%d,%d",
    (led_status ? 1 : 0), (led_connection ? 1 : 0));

  //PGM_STRING_MAPPED_TO_RAM(command, "POLAR=");
  hc05.sendAtCommand(temp, timeout, 0);
  return debugTerminal("HC05_setLeds");
  
}

/****************************************************************
*FUNCTION NAME:setPortState
*FUNCTION     :set HC05 Ports States
*INPUT        :port_states , port_num , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::setPortState(uint8_t port_num,
  uint8_t port_state, unsigned long timeout)
{
  char temp[20];
  snprintf(temp, sizeof(temp), "AT+PIO=%u,%u", port_num, port_state);

  //PGM_STRING_MAPPED_TO_RAM(command, "PIO=");
  hc05.sendAtCommand(temp, timeout, 0);
  return debugTerminal("HC05_setPortState");
  processPortState(port_num, port_state, 1);
}

/****************************************************************
*FUNCTION NAME:getMultiplePorts
*FUNCTION     :getMultiplePorts
*INPUT        :port_states , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::getMultiplePorts(uint16_t &port_states, unsigned long timeout)
{
  startOperation(timeout);

  //PGM_STRING_MAPPED_TO_RAM(command, "MPIO?");
  hc05.sendAtCommand("AT+MPIO?\r\n", timeout, 0 );
  return debugTerminal("HC05_getMultiplePorts");
  processMultiPortState(port_states, 1);

  port_states = 0;

  char response[20];
  //PGM_STRING_MAPPED_TO_RAM(response_pattern, "+MPIO:");
  const char *states_part = hc05.readResponseWithPrefix(
    response, sizeof(response), AT_RESP_MPIO);

  if (m_errCode != HC05_OK)
    return false;

  if (!states_part)
    return hc05.readOperationResult() && false;

  port_states = htoul(states_part);

  return hc05.readOperationResult();
}

/****************************************************************
*FUNCTION NAME:setMultiplePorts
*FUNCTION     :setMultiplePorts  
*INPUT        :port_states , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::setMultiplePorts(uint16_t port_states, unsigned long timeout)
{
  char temp[20];
  snprintf(temp, sizeof(temp), "AT+MPIO=%x", port_states);
  //PGM_STRING_MAPPED_TO_RAM(command, "MPIO=");
  hc05.sendAtCommand(temp, timeout, 0);
  return debugTerminal("HC05_setMultiplePorts");
  
