labved/NODEBOX-RF868_STM32LDISCO/USER/LIB/LIB_HC05/LIB_HC05.cpp
  const char *status_part = hc05.readResponseWithPrefix(
    response, sizeof(response), AT_RESP_DISC);
/* 
  if (strcmp(status_part, AT_SUCCESS) == 0)
    m_errCode = HC05_OK;
  else if (strcmp(status_part, AT_LINK_LOSS) == 0)
    m_errCode = HC05_ERR_DISC_LINK_LOSS;
  else if (strcmp(status_part, AT_NO_SLC) == 0)
    m_errCode = HC05_ERR_DISC_NO_SLC;
  else if (strcmp(status_part, AT_TIMEOUT) == 0)
    m_errCode = HC05_ERR_DISC_TIMEOUT;
  else if (strcmp(status_part, AT_ERROR) == 0)
    m_errCode = HC05_ERR_DISC_ERROR;

 */   return hc05.readOperationResult();
}



/****************************************************************
*FUNCTION NAME:processversion
*FUNCTION     :processversion
*INPUT        :addrs
*OUTPUT       :void
****************************************************************/
bool LIB_HC05::processVersion(char *buffer, size_t buffer_size, uint16_t addrs)
{
	char      *strStart, *str1;
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
     
  str1 = strstr(strStart,"+VERSION:");
  
  if(str1!=NULL)
    sscanf(str1,"%s",Sim80x.IMEI);

  // update Flash IC here
		
  return debugTerminal("HC05_getversion");
  
  
	
}

/****************************************************************
*FUNCTION NAME:processRemoteDeviceName
*FUNCTION     :processRemoteDeviceName
*INPUT        :addrs
*OUTPUT       :void
****************************************************************/
bool LIB_HC05::processRemoteDeviceName(const BluetoothAddress &address,
  char *buffer, size_t buffer_size, uint16_t addrs)
{
	char      *strStart, *str1;
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  

    char response[40];
  
  //PGM_STRING_MAPPED_TO_RAM(response_pattern, "+RNAME:");
  char *name_part = hc05.readResponseWithPrefix(response, sizeof(response), "+RNAME:");

  if (m_errCode != HC05_OK)
    return false;

  if (!name_part)
  {
    *buffer = 0;
    return hc05.readOperationResult() && false;
  }

  //PGM_STRING_MAPPED_TO_RAM(format, "%s");
  snprintf(buffer, buffer_size, "%s", name_part);

     
  
  
  if(str1!=NULL)
    sscanf(str1,"%s",Sim80x.IMEI);

  // update Flash IC here
		
  return debugTerminal("HC05_RemoteDeviceName");
  
  

}

/****************************************************************
*FUNCTION NAME:processDeviceClass
*FUNCTION     :processDeviceClass
*INPUT        :addrs
*OUTPUT       :void
****************************************************************/
bool LIB_HC05::processDeviceClass(uint32_t &device_class, uint16_t addrs)
{
	char      *strStart, *str1;
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
     
  
  device_class = 0;

  char response[40];
  //PGM_STRING_MAPPED_TO_RAM(response_pattern, "+CLASS:");
  const char *class_part = hc05.readResponseWithPrefix(
    response, sizeof(response), AT_RESP_CLASS);

  if (m_errCode != HC05_OK)
    return false;

  if (!class_part)
    return hc05.readOperationResult() && false;

  device_class = htoul(class_part);

  return hc05.readOperationResult();

  
  if(str1!=NULL)
    sscanf(str1,"%s",Sim80x.IMEI);

  // update Flash IC here
		
  return debugTerminal("HC05_DeviceClass");
  
  

}

/****************************************************************
*FUNCTION NAME:process
*FUNCTION     :process
*INPUT        :addrs
*OUTPUT       :void
****************************************************************/
bool LIB_HC05::processInquiryAccessCode( uint32_t &iac, uint16_t addrs)
{

  iac = 0;
   debugTerminal("HC05_InquiryAccessCode");

  if (isOperationTimedOut())
    return false;

  char response[30];
  
  //PGM_STRING_MAPPED_TO_RAM(response_pattern, "+IAC:");
  const char *iac_part = hc05.readResponseWithPrefix(
    response, sizeof(response), AT_RESP_IAC);

  if (m_errCode != HC05_OK)
    return false;

  if (!iac_part)
    return hc05.readOperationResult() && false;

  iac = htoul(iac_part);

  return hc05.readOperationResult();

  
  

}

/****************************************************************
*FUNCTION NAME:process
*FUNCTION     :process
*INPUT        :addrs
*OUTPUT       :void
****************************************************************/
bool LIB_HC05::processInquiryMode(HC05_InquiryMode &inq_mode,
  int16_t &max_devices, uint8_t &max_duration, uint16_t addrs)
{

  inq_mode = HC05_INQUIRY_STANDARD;
  max_devices = 0;
  max_duration = 0;

  char response[30];
  //PGM_STRING_MAPPED_TO_RAM(response_pattern, "+INQM:");
  char *mode_part = hc05.readResponseWithPrefix(
    response, sizeof(response), AT_RESP_INQM);

  if (m_errCode != HC05_OK)
    return false;

  if (!mode_part)
    return hc05.readOperationResult() && false;

  inq_mode = static_cast<HC05_InquiryMode>(atol(mode_part));
  mode_part = strchrnul(mode_part, ',');

  if (*mode_part != ',')
    return hc05.readOperationResult() && false;

  max_devices = atol(++mode_part);
  mode_part = strchrnul(mode_part, ',');

  if (*mode_part != ',')
    return hc05.readOperationResult() && false;

  max_duration = atol(++mode_part);

  return hc05.readOperationResult();

 debugTerminal("HC05_InquiryMode");
  
  

}

/****************************************************************
*FUNCTION NAME:processPassword
*FUNCTION     :processPassword
*INPUT        :addrs
*OUTPUT       :void
****************************************************************/
bool LIB_HC05::processPassword(char *buffer, uint16_t addrs)
{
	char      *strStart, *str1;
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
     
  
  
  if(str1!=NULL)
    sscanf(str1,"%s",Sim80x.IMEI);

  // update Flash IC here
		
  return debugTerminal("HC05_Password");
  
  

}

/****************************************************************
*FUNCTION NAME:processSerialMode
*FUNCTION     :processSerialMode
*INPUT        :addrs
*OUTPUT       :void
****************************************************************/
bool LIB_HC05::processSerialMode(uint32_t &speed, uint8_t &stop_bits,
  HC05_Parity &parity, uint16_t addrs)
{
	
  char response[30];
  //PGM_STRING_MAPPED_TO_RAM(response_pattern, "+UART:");
  char *mode_str = hc05.readResponseWithPrefix(response, sizeof(response), AT_RESP_UART);

  if (m_errCode != HC05_OK)
    return false;

  if (!mode_str)
    return hc05.readOperationResult() && false;

