labved/NODEBOX-RF868_STM32LDISCO/USER/LIB/LIB_HC05/LIB_HC05.cpp
  speed = atol(mode_str);
  mode_str = strchrnul(mode_str, ',');

  if (*mode_str != ',')
  {
    m_errCode = HC05_FAIL;
    return hc05.readOperationResult() && false;
  }

  stop_bits = atol(++mode_str) + 1;
  mode_str = strchrnul(mode_str, ',');

  if (*mode_str != ',')
  {
    m_errCode = HC05_FAIL;
    return hc05.readOperationResult() && false;
  }

  parity = static_cast<HC05_Parity>(atol(++mode_str));

  return hc05.readOperationResult();

  // update Flash IC here
		
   debugTerminal("HC05_SerialMode");
  
  

}

/****************************************************************
*FUNCTION NAME:processConnectionMode
*FUNCTION     :processConnectionMode
*INPUT        :addrs
*OUTPUT       :void
****************************************************************/
bool LIB_HC05::processConnectionMode(
  HC05_Connection &connection_mode, uint16_t addrs)
{
	char      *strStart, *str1;
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
     
  
  
  if(str1!=NULL)
    sscanf(str1,"%s",Sim80x.IMEI);

  // update Flash IC here
		
  return debugTerminal("HC05_ConnectionMode");
  
  

}

/****************************************************************
*FUNCTION NAME:processLed
*FUNCTION     :processLed
*INPUT        :addrs
*OUTPUT       :void
****************************************************************/
bool LIB_HC05::processLed(bool &led_status,
  bool &led_connection, uint16_t addrs)
{


  // update Flash IC here
		
   debugTerminal("HC05_getLedStatus");
  
  led_status = 0;
  led_connection = 0;

  char response[30];
  
  //PGM_STRING_MAPPED_TO_RAM(response_pattern, "+POLAR:");
  
  char *status_part = hc05.readResponseWithPrefix(
    response, sizeof(response), AT_RESP_POLAR);

  if (m_errCode != HC05_OK)
    return false;

  if (!status_part)
    return hc05.readOperationResult() && false;

  led_status = atol(status_part);
  status_part = strchrnul(status_part, ',');

  if (*status_part != ',')
    return hc05.readOperationResult() && false;

  led_connection = atol(++status_part);

  return hc05.readOperationResult();

  

}

/****************************************************************
*FUNCTION NAME:processPortState
*FUNCTION     :processPortState
*INPUT        :addrs
*OUTPUT       :void
****************************************************************/
bool LIB_HC05::processPortState(uint8_t port_num,
  uint8_t port_state, uint16_t addrs)
{
	char      *strStart, *str1;
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
     
  
  
  if(str1!=NULL)
    sscanf(str1,"%s",Sim80x.IMEI);

  // update Flash IC here
		
  return debugTerminal("HC05_PortState");
  
  

}

/****************************************************************
*FUNCTION NAME:processMultiPortState
*FUNCTION     :processMultiPortState
*INPUT        :addrs
*OUTPUT       :void
****************************************************************/
bool LIB_HC05::processMultiPortState(uint16_t &port_states, uint16_t addrs)
{
  char      *strStart, *str1;
  strStart = (char*)&Sim80x.UsartRxBuffer[0];
        
  if(str1!=NULL)
    sscanf(str1,"%s",Sim80x.IMEI);

  // update Flash IC here
		
  debugTerminal("HC05_processMultiPortState");
  
  port_states = 0;

  char response[20];
  //PGM_STRING_MAPPED_TO_RAM(response_pattern, "+MPIO:");
  const char *states_part = hc05.readResponseWithPrefix(
    response, sizeof(response), AT_RESP_MPIO);

  if (m_errCode != HC05_OK)
    return false;

  if (!states_part)
    return hc05.readOperationResult() && false;

  port_states = htoul(states_part);

  return hc05.readOperationResult();
  

}

/****************************************************************
*FUNCTION NAME:processGetInquiryAndPagingParams
*FUNCTION     :processGetInquiryAndPagingParams
*INPUT        :addrs
*OUTPUT       :void
****************************************************************/
bool LIB_HC05::processGetInquiryAndPagingParams(uint16_t &inquiry_interval, 
uint16_t &inquiry_duration, uint16_t &paging_interval, uint16_t &paging_duration, uint16_t addrs)
{

	char      *strStart, *str1;
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
     
  debugTerminal("HC05_processGetInquiryAndPagingParams");
  char response[40];
  char *params_part = hc05.readResponseWithPrefix(
    response, sizeof(response), AT_RESP_IPSCAN);

  if (m_errCode != HC05_OK)
    return false;

  if (!params_part)
    return hc05.readOperationResult() && false;

  inquiry_interval = atol(params_part);
  params_part = strchrnul(params_part, ',');

  if (*params_part != ',')
    return hc05.readOperationResult() && false;

  inquiry_duration = atol(++params_part);
  params_part = strchrnul(params_part, ',');

  if (*params_part != ',')
    return hc05.readOperationResult() && false;

  paging_interval = atol(++params_part);
  params_part = strchrnul(params_part, ',');

  if (*params_part != ',')
    return hc05.readOperationResult() && false;

  paging_duration = atol(++params_part);

  return hc05.readOperationResult();
 

  // update Flash IC here
		
  
  

}

/****************************************************************
*FUNCTION NAME:processSecurityAndEncryption
*FUNCTION     :processSecurityAndEncryption
*INPUT        :addrs
*OUTPUT       :void
****************************************************************/
bool LIB_HC05::processSecurityAndEncryption(HC05_Security &security,
  HC05_Encryption &encryption, uint16_t addrs)
{
	char      *strStart, *str1;
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
     
  char response[20];
  //PGM_STRING_MAPPED_TO_RAM(response_pattern, "+SENM:");
  char *params_part = hc05.readResponseWithPrefix(
    response, sizeof(response), AT_RESP_SENM);

  if (m_errCode != HC05_OK)
    return false;

  if (!params_part)
    return hc05.readOperationResult() && false;

  security = static_cast<HC05_Security>(atol(params_part));
  params_part = strchrnul(params_part, ',');

  if (*params_part != ',')
    return hc05.readOperationResult() && false;

  encryption = static_cast<HC05_Encryption>(atol(++params_part));

  return hc05.readOperationResult();
  
  
  if(str1!=NULL)
    sscanf(str1,"%s",Sim80x.IMEI);

  // update Flash IC here
		
  return debugTerminal("HC05_processSecurityAndEncryption");
  
  

