labved/NODEBOX-RF868_STM32LDISCO/USER/LIB/LIB_HC05/LIB_HC05.cpp
}

/****************************************************************
*FUNCTION NAME:processState
*FUNCTION     :processState
*INPUT        :addrs
*OUTPUT       :void
****************************************************************/
bool LIB_HC05::processState(HC05_State &state, uint16_t addrs)
{
	char      *strStart, str1[40];
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
     
  //PGM_STRING_MAPPED_TO_RAM(response_pattern, "+STATE:");
  const char *status_part = hc05.readResponseWithPrefix(
    str1, sizeof(str1), "+STATE:");

  if (m_errCode != HC05_OK)
    return false;

  if (!status_part)
    return hc05.readOperationResult() && false;
  
  if(str1!=NULL)
    sscanf(str1,"%s",Sim80x.IMEI);

  // update Flash IC here
	state = HC05_UNKNOWN;
  debugTerminal("HC05_processState");
  
  if (strcmp(status_part, AT_INITIALIZED) == 0)
    state = HC05_INITIALIZED;
  else if (strcmp(status_part, AT_READY) == 0)
    state = HC05_READY;
  else if (strcmp(status_part, AT_PAIRABLE) == 0)
    state = HC05_PAIRABLE;
  else if (strcmp(status_part, AT_PAIRED) == 0)
    state = HC05_PAIRED;
  else if (strcmp(status_part, AT_INQUIRING) == 0)
    state = HC05_INQUIRING;
  else if (strcmp(status_part, AT_CONNECTING) == 0)
    state = HC05_CONNECTING;
  else if (strcmp(status_part, AT_CONNECTED) == 0)
    state = HC05_CONNECTED;
  else if (strcmp(status_part, AT_DISCONNECTED) == 0)
    state = HC05_DISCONNECTED;
  else if (strcmp(status_part, AT_UNKNOWN) == 0)
    state = HC05_UNKNOWN;

  return hc05.readOperationResult();

}

/****************************************************************
*FUNCTION NAME:processPair
*FUNCTION     :processPair
*INPUT        :addrs
*OUTPUT       :void
****************************************************************/
bool LIB_HC05::processPair(uint16_t addrs)
{

	char      *strStart, *str1;
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
     
  
  
  if(str1!=NULL)
    sscanf(str1,"%s",Sim80x.IMEI);

  // update Flash IC here
		
  debugTerminal("HC05_HC05_processPair");
  
  

}

/****************************************************************
*FUNCTION NAME:processDisconnect
*FUNCTION     :processDisconnect
*INPUT        :addrs
*OUTPUT       :void
****************************************************************/
bool LIB_HC05::processDisconnect(uint16_t addrs)
{

	char      *strStart, *str1;
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
     
  
  if(str1!=NULL)
    sscanf(str1,"%s",Sim80x.IMEI);

  // update Flash IC here
	
  const char *status_part = hc05.readResponseWithPrefix(
    Sim80x.IMEI, sizeof(Sim80x.IMEI), "+DISC:");
  if (strcmp(status_part, "SUCCESS") == 0)
    m_errCode = HC05_OK;
  else if (strcmp(status_part, "LINK_LOSS") == 0)
    m_errCode = HC05_ERR_DISC_LINK_LOSS;
  else if (strcmp(status_part, "NO_SLC") == 0)
    m_errCode = HC05_ERR_DISC_NO_SLC;
  else if (strcmp(status_part, "TIMEOUT") == 0)
    m_errCode = HC05_ERR_DISC_TIMEOUT;
  else if (strcmp(status_part, "ERROR") == 0)
    m_errCode = HC05_ERR_DISC_ERROR;

	
  debugTerminal("HC05_HC05_processDisconnect");
  
  

}

/****************************************************************
*FUNCTION NAME:processDisconnect
*FUNCTION     :processDisconnect
*INPUT        :addrs
*OUTPUT       :void
****************************************************************/
bool LIB_HC05::processCountDevicesInList(uint8_t &device_count, uint16_t addrs)

{
  char response[20];
  //PGM_STRING_MAPPED_TO_RAM(response_pattern, "+ADCN:");
  const char *count_part = hc05.readResponseWithPrefix(
    response, sizeof(response), AT_RESP_ADCN);

  if (m_errCode != HC05_OK)
    return false;

  if (!count_part)
    return hc05.readOperationResult() && false;

  device_count = atol(count_part);

  return hc05.readOperationResult();

}

/****************************************************************
*FUNCTION NAME:processDisconnect
*FUNCTION     :processDisconnect
*INPUT        :addrs
*OUTPUT       :void
****************************************************************/
bool LIB_HC05::processDeleteAllDevicesFromList(uint16_t addrs)
{	
	char      *strStart, *str1;
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
     
  str1 = strstr(strStart,"A/\r\r\n");
  
  if(str1!=NULL)
    sscanf(str1,"A/\r\r\n%s",Sim80x.IMEI);

  // update Flash IC here
		
  return debugTerminal("Sim80x_getLastCommand");
  
}

/****************************************************************
*FUNCTION NAME:processDisconnect
*FUNCTION     :processDisconnect
*INPUT        :addrs
*OUTPUT       :void
****************************************************************/
bool LIB_HC05::processGetSniffParams(uint16_t max_time, uint16_t min_time,
  uint16_t retry_interval, uint16_t sniff_timeout, uint16_t addrs)
{
  char response[40];
  //PGM_STRING_MAPPED_TO_RAM(response_pattern, "+SNIFF:");
  char *params_part = hc05.readResponseWithPrefix(
    response, sizeof(response), AT_RESP_SNIFF);

  if (m_errCode != HC05_OK)
    return false;

  if (!params_part)
    return hc05.readOperationResult() && false;

  max_time = atol(params_part);
  params_part = strchrnul(params_part, ',');

  if (*params_part != ',')
    return hc05.readOperationResult() && false;

  min_time = atol(++params_part);
  params_part = strchrnul(params_part, ',');

  if (*params_part != ',')
    return hc05.readOperationResult() && false;

  retry_interval = atol(++params_part);
  params_part = strchrnul(params_part, ',');

  if (*params_part != ',')
    return hc05.readOperationResult() && false;

  sniff_timeout = atol(++params_part);

  return hc05.readOperationResult();
 
}







#endif

#endif